import '../CSS/Selfintro.css';

const SelfIntro = () => {
  return (
    <div id ="selfIntro">
      <div class ="division">
        <h3>백엔드 개발자[한건희]</h3>
          <p>안녕하세요. 저는 한건희이며, 3년 이상의 Java 및 Spring Framework를 이용한 백엔드 개발 경험이 있는 소프트웨어 엔지니어 입니다.
            지속적인 기술 습득과 혁신적인 해결책 제공을 통해 비지니스의 가치를 극대화하는 데 기여하고자 합니다.
          </p>
      </div>

      <div class ="division">
        <h3>성장과정</h3>
        <p>
          저는 기술이 우리의 삶을 어떻게 변화시킬 수 있는지를 늘 궁금해하는 가정에서 자랐씁니다. 어린 시절부터 컴퓨터와 기술에 둘러싸여 자라면서, 저는 문제를 해결하는 데 있어 시스템적인 사고를 배웠고,
          어려운 문제에 직면했을 때 물러서지 않는 인내력을 기를 수 있었습니다.
          제 가족은 항상 호기심을 가지고 새로운 것을 배우며, 각자의 열정을 존중하라고 가르쳤습니다. 이러한 환경 덕분에 저는 변화에 빠르게 적응하고, 지속적으로 성장하는 기술 분야에서 제 자리를 찾을 수 있었습니다.
          이와 같은 배경은 저를 오늘날의 저로 만들어 준 중요한 요소이며, 이러한 성장 배경이 제 기술적인 능력과 함께 백엔드 개발자로서의 역량을 강화시키고 있습니다.
        </p>
      </div>
      
      <div class ="division">
        <h3>취미와 특기</h3>
        <p>
          제 일상에서 가장 큰 비중을 차지하는 취미는 코딩 문제를 해결하는 것 입니다.'프로젝트 오일러(Project Euler)', '백준'과 같은 온라인 플랫폼에서 수학적 문제를 알고리즘으로 풀어내는 것을 좋아합니다. 이는 제 분석적 사고와 시스템적 접근 방식을 키우는 데 도움이 되며, 실제 작업 환경에서의 문제 해결에 직접적인 영향을 미칩니다.
          제 특기 중 하나는 오픈 소스 프로젝트에 기여하는 것입니다. 이를 통해 다양한 개발자와 협력하고, 코드 리뷰를 통해 서로의 작업을 개선하는 과정을 경험합니다. 또한, 이러한 커뮤니티 활동은 저에게 새로운 기술과 도구를 배울 수 있는 기회를 제공합니다. 뿐만 아니라, 저는
          웨이트를 통해 체력을 단련하고 스트레스를 관리합니다. 웨이트를 하면 일상에서의 긴장을 해소하고, 장기적인 프로젝트에 집중할 수 있는 정신적인 균형을 유지하는 데 도움이 됩니다.
          이러한 취미와 특기는 저를 기술적으로 능숙한 백엔드 개발자로 성장하게 하고, 개인적으로도 균형 잡힌 삶을 영위하도록 도와줍니다.
        </p>
      </div>
      
      <div class ="division">
        <h3>입사지원동기 </h3>
        <p>
          귀사의 혁신적인 기술과 개발 문화에 깊은 인상을 받아 입사를 지원하게 되었습니다. 제가 지니고 있는 백엔드 개발에 대한 깊은 열정과 경험이 귀사의 목표와 완벽하게 부합한다고 생각합니다.
          특히, 귀사가 최근에 출시한 웹에 사용된 기술에 큰 관심을 가지고 있으며, 이에 대한 제 경험과 지식을 바탕으로 귀사의 팀과 함께 더욱 혁신적인 솔루션을 개발하고 싶습니다. 제가 지닌 Spring Framework에 대한 전문성과 프로젝트나 경험에서 쌓은 실무 경험이 귀사의 기술 팀에 가치를 더할 것이라 확신합니다. 
          또한, 귀사의 지속 가능한 성장과 개발자 개인의 성장을 동시에 중시하는 문화에 깊이 공감하며, 이러한 환경에서 제 기술적 능력을 더욱 키우고, 귀사의 성공에 기여하고 싶습니다.
          제가 이 자리에 지원하는 이유는 단순히 직업을 얻기 위함이 아니라, 귀사와 함께 성장하고, 귀사의 비전에 기여하고자 하는 강력한 의지에서 비롯됩니다. 귀사의 일원으로서 기술적 도전을 즐기며, 팀워크를 발휘하여 귀사의 미래에 중요한 역할을 하고자 합니다.
      </p>
      </div>

      <div class ="division">
        <h3>포부 및 장래계획 </h3>
        <p>
        프로페셔널한 백엔드 개발자로서, 저의 궁극적인 목표는 최첨단 기술을 활용하여 사용자들에게 더 뛰어난 경험을 제공하는 것입니다. 근본적으로, 저는 기술이 인간의 삶을 개선하는 데 기여해야 한다고 믿으며, 이러한 신념을 바탕으로 귀사에서 혁신적인 서비스와 솔루션을 개발하고자 합니다.
        단기적으로는 귀사의 팀에 빠르게 통합되어, 제가 가진 기술을 바로 활용하고 결과를 내는 것을 목표로 합니다. 특히, 백엔드 웹 프로젝트에 대해 더 깊이 이해하고, 이 분야에서 귀사의 선두 주자로서의 입지를 공고히 하는 데 기여하고 싶습니다.
        중기적으로는 귀사의 기술 리더십을 발휘하여, 더 효율적이고 혁신적인 백엔드 아키텍처를 설계하고 구현하는 데 중추적인 역할을 하고자 합니다. 이를 통해 팀의 생산성을 높이고, 비즈니스 목표 달성에 있어 핵심적인 기여를 할 수 있을 것으로 기대합니다.
        장기적으로는 귀사 내에서 기술 멘토 및 리더로서의 역할을 수행하며, 후배 개발자들을 교육하고 이끌어, 팀 전체의 역량을 강화하는 것을 목표로 합니다. 더불어, 귀사의 기술적 비전과 전략을 모양짓는 데에도 직접 참여하여, 귀사가 지속 가능한 성장을 이루고 업계에서 더욱 두각을 나타낼 수 있도록 하고 싶습니다.
        이러한 포부를 실현하기 위해, 지속적으로 새로운 기술을 학습하고, 최신 트렌드에 발맞춰 나가는 것은 물론, 개인의 기술적 전문성을 키우고 회사에 기여하는 방법을 끊임없이 탐색할 것입니다. 귀사와 함께 성장하는 것은 저에게 큰 영광이며, 이를 통해 업계에서 인정받는 전문가로 거듭나는 것이 저의 장래 계획입니다.
        </p>  
      </div>
    </div>
  );
};

export default SelfIntro;