import "../CSS/Certificate.css";

const Certificate3 = () => {
  return (
    <div>
      <h1>네트워크 관리사</h1>
      <fieldset>
        <legend>네트워크 관리사</legend>
        <ul>
          <li>**취득 일자**: 2022년 5월</li>

          <li>**발급 기관:  한국정보통신진흥협회**</li>
          <li>복잡한 네트워크 인프라의 설계, 구현, 관리에 대한 깊은 지식을 바탕으로 백엔드 운영의 견고함과 확장성을 보장합니다.</li>

          <li>애플리케이션 성능에 영향을 미칠 수 있는 네트워크 관련 문제를 진단하고 수정하는 능력 향상, 고트래픽 백엔드 시스템에 대한 효율적인 해결책을 제공할 수 있습니다.</li>
          <li>데이터 전송 시 보안을 강화하고 다양한 노드간의 통신을 보호하는 고급 보안 조치를 실행하는 데 능숙합니다. 백엔드 과정에서 사용자 데이터의 무결성과 기밀성 유지에 필수적입니다.</li>
          <li>네트워킹 고려 사항을 전체 백엔드 개발 생명주기에 통합하기 위해 다기능 팀과 긴밀히 협락하는 경험, 원활한 배포와 운영을 보장합니다.</li>
        </ul>
      </fieldset>
    </div>
  );
};

export default Certificate3;