
const Vision = () => {
  return (
    <div>
      <h1>장기적인 직업 목표</h1>
      <fieldset>
        <legend>데이터 중심의 혁신적인 백엔드 아키택처 개발</legend>
        <ul>
          <li>최신 기술 트렌드를 접목하여 데이터 처리 및 관리 방시을 개선하고, 대규모 분산 시스템에서의 성능 최적화를 선도하고자 합니다.</li>
          <li>클라우드 기반의 서비스로의 전환을 가속화하여 유연성과 확장성을 극대화하며, 이를 통해 기업의 디지털 변환을 지원하는 것이 목표입니다.</li>
        </ul>
      </fieldset>
      <fieldset>
        <legend>지속 가능한 개발 문화 구축</legend>
        <ul>
          <li>지식 공유와 협업을 기반으로 한 개발 문화를 조성하여, 팀원 모두가 최신 기술 동향에 능동적으로 대응하고 개인의 성장을 촉진할 수 있는 환경을 만들고자 합니다.</li>
          <li>코드의 품질을 지속적으로 개선하고 유지 보수성을 높여, 신속한 피드백 루프와 빠른 반복을 통한 프로젝트 개선에 기여하고자 합니다.</li>
        </ul>
      </fieldset>
      <fieldset>
        <legend>멘토링 및 지도</legend>
        <ul>
          <li>경험을 살려 후배 개발자들을 멘토링하고 지도하여, 전문성을 갖춘 차세대 개발자들이 성장할 수 있도록 지원하는 것을 목표로 합니다.</li>
          <li>기술 커뮤니티에서 활동을 통해 지식을 공유하고, 오픈 소스 프로젝트에 기여함으로써 업계에 긍정적인 영향을 끼치고자 합니다.</li>
        </ul>
      </fieldset>
    </div>
  );
};

export default Vision;